create table usedcar (
    num int not null auto_increment,
    plate_num char(20) not null,
    model_name char(20) not null,
    make_year int,
    mileage int,
    color char(20) not null,
    price int,
    primary key(num)
);

insert into usedcar (plate_num, model_name, make_year, mileage, color, price) values
('12가1234',  '쏘나타', 2016, 133033, '검정',   890),
('82두2342',  '쏘나타', 2016, 104832, '흰색',  1050),
('33머5531',  '쏘나타', 2022,   3900, '초록색', 3090),
('432자9594', '쏘나타', 2012, 167468, '회색',   450),
('52고3472',  '쏘나타', 2018,  67640, '검정',  1820),
('678노1199', '그랜저', 2018,  29893, '검정',  2830),
('14가1003',  '그랜저', 2011, 184298, '검정',   699),
('18나8734',  '그랜저', 2015, 130535, '회색',  1050),
('832다9811', '그랜저', 2013, 134647, '회색',   749),
('132바5289', '아반떼', 2018,  94379, '회색',   960),
('82카2309',  '아반떼', 2018,  27955, '파란색', 1390),
('91다7009',  '아반떼', 2011,  55268, '회색',   490),
('182로3439', '아반떼', 2017,  60006, '흰색',  1220),
('29지5822',  '아반떼', 2013,  73461, '회색',   670),
('38두3691',  '아반떼', 2019,  56530, '검정',  1220),
('12지3948',  '아반떼', 2020,  26347, '빨간색', 2638);
